Ran Plan for dir: `resources` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.container-vm_example_simple_instance.module.gce-container.data.google_compute_image.coreos: Reading...
module.container-vm_example_simple_instance.module.gce-container.data.google_compute_image.coreos: Read complete after 1s [id=projects/cos-cloud/global/images/cos-stable-77-12371-89-0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.container-vm_example_simple_instance.google_compute_instance.vm will be created
+ resource "google_compute_instance" "vm" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + labels               = {
          + "container-vm" = "cos-stable-77-12371-89-0"
        }
      + machine_type         = "n1-standard-1"
      + metadata             = {
          + "gce-container-declaration" = <<-EOT
                "spec":
                  "containers":
                  - "env":
                    - "name": "TEST_VAR"
                      "value": "Hello World!"
                    "image": "gcr.io/google-samples/hello-app:1.0"
                    "volumeMounts":
                    - "mountPath": "/cache"
                      "name": "tempfs-0"
                      "readOnly": false
                  "restartPolicy": "Always"
                  "volumes":
                  - "emptyDir":
                      "medium": "Memory"
                    "name": "tempfs-0"
            EOT
          + "google-logging-enabled"    = "true"
          + "google-monitoring-enabled" = "true"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "hello-world-container-vm-60b69fa4"
      + project              = "xyz"
      + self_link            = (known after apply)
      + tags                 = [
          + "container-vm-example",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "zone"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "https://www.googleapis.com/compute/v1/projects/cos-cloud/global/images/cos-stable-77-12371-89-0"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "subnet1"
          + subnetwork_project = "xyz"

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on .terraform/modules/container-vm_example_simple_instance/examples/simple_instance/main.tf line 17:
│   17: provider "google" {
│ 
│ Earlier versions of Terraform used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "google" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.container-vm_example_simple_instance:
│     google = {
│       source = "hashicorp/google"
│     }
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.23.241.243/lock?id=romeshb29%252Fatlantis-local-poc%252Fresources%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`